{"title": "Coronavirus (COVID-19) Pandemic", "link": "https://sci.pdn.ac.lk/news/emergency/", "sentences": "[' Coronavirus (COVID-19) Pandemic News Item ', 'Coronavirus (COVID-19) Pandemic World health organization has declared new Coronavirus disease (COVID-19) as a pandemic and Sri Lankan government takes maximum security measures to control the spreading of COVID-19 within the country. ', 'Coronavirus Disease (COVID-19) ', 'SARS-CoV-2 virus transmission leading to COVID-19 ', 'What Happens If You Get Coronavirus? ', 'How COVID-19 Affects the Body? ', 'Corona virus :', 'Symptoms & Caregiving (English) ', '(Sinhala) ', '(Tamil) ', 'General Safety rules: ', 'Observe at least one metre distance between persons at all time. ', 'Wash hands regularly with liquid soap. ', 'Welcome each other without physical contact. ', 'Do not share personal equipment (tablet, phones, stationary). ', 'Stay at home/hostel if you show any symptoms of Covid-19.', 'Contact the Health Centre if you are in a hostel. ', 'In classrooms (theory or practical), every person should, at all times, wear a mask. ', 'Masks are to be disposed in a bin with a lid.', 'Do not litter. ', 'Category ', 'All News Events Noticeboard ']"}
{"title": "CSUP - Year 2021", "link": "https://csup.soc.pdn.ac.lk/events/year-2021", "sentences": "[' CSUP - Year 2021 ', 'Search this site Year 2021 ', 'Basic HTML CSS JavaScript for Web Design Python Workshop Online Sessio n ', 'VLeader 1.4 Official Network Partner Report abuse Report abuse ']"}
{"title": "News and Events", "link": "https://sci.pdn.ac.lk/news-events.php?t=a", "sentences": "[' News and Events ', 'News & Events ', 'Recent News and Events ', 'Virtual Speaker Series:', 'Talk', 'No 03 - Planning for Your Graduate Studies and the Life Beyond September 22, 2020 ', 'Dear All, Please join us for the Department of Botany, University of Peradeniya Virtual Speaker Series this Saturday, September 26, at 09:00 a.m .', 'for the seminar titled “ Planning for your graduate studies and the life beyond ” by Dr. Dayanjan S Wijesinghe, Assistant Professor, School of Pharmacy,Virginia Commonwealth University, VA, USA. ', 'Space is limited, so please register to participate. ', 'Register', 'Here : https://learn.zoom.us/meeting/register/u5Asd-quqjIiHNd0-1EHLzvCvovsuRoUQEao We look forward to seeing you at the event later this week. ', 'See the Poster All my best. ', 'Dr. Nalin Suranjith Organizers: ', 'Dr. Nalin Suranjith and Dr. Sarangi Athukorala. ', 'Department of Botany Faculty of Science University of Peradeniya ', 'Virtual Speaker Series - August 2020 ', 'August 11, 2020 ', 'Dear All, Please join us for the Department of Botany, University of Peradeniya Virtual Speaker Series this Sunday, August 16, at 09:00 a.m. for the seminar titled \"Knowledge of Plant Biology: Key to Growing Better Crops', '\" by Dr. Tharindu Weeraratne , Director of Crop Science and Agronomy, Autogrow, New Zealand. ', 'After the talk, we will discuss the study and career opportunities in New Zealand. ', 'Space is limited, so please register to participate. ', 'Register', 'Here https://learn.zoom.us/meeting/register/u5YvcuqsrjooGNyG1KqBfSPJgkfkAObgIKKt ', 'We look forward to seeing you at the event later this week. ', 'All my best. ', 'See the Poster Dr. Nalin Suranjith Organizers: Dr. Nalin Suranjith and Dr. Sarangi Athukorala. ', 'Department of Botany ', 'Fully Automatic Hand Washing Unit July 22, 2020 ', 'A completely touch-free fully automatic hand-washing unit has been constructed in the Electronics Laboratory of the Department of Chemistry, Faculty of Science.', 'The unit consists of a soap solution dispenser, a water tap and a hot-air dryer, all activated by infra-red sensors.', 'This is the first hand-washing unit of this kind combining washing with soap and drying with hot air so that it is expected to be more effective against Covid-19 .', 'The project was initiated by ', 'Prof. H.M.N. Bandara and technical assistance was provided voluntarily by Mr. Mahinda Paranawitharana , Staff Technical Officer (Electronic) of the Department of Chemistry.', 'Welding and other metal work were done voluntarily by the staff of the Department of Physics workshop. ', 'The first unit constructed was donated to the Department of Chemistry and it is now in operation. ', 'Construction of more of these units for the faculty is under way. ', 'Virtual Speaker Series - July 2020 July 15, 2020 ', 'Dear all, Please join us for the Department of Botany, University of Peradeniya Virtual Speaker Series this Saturday, July 18, at 09:00 a.m. for the seminar titled “Effects of elevated carbon dioxide plus chronic warming on plant nitrogen relations” by Dr. Dileepa Jayawardena , Postdoctoral Fellow at Parma Research and Extension Center, University of Idaho. ', 'After the talk we will discuss the obstacles and opportunities faced by International PhD students in USA with the aftermath of COVID-19. ', 'Space is limited, so please register to participate.', 'You will have an opportunity to submit questions in advance or during the live Zoom conversation. ', 'Register', 'Here ', 'https://learn.zoom.us/meeting/register/u5MudeqgrDIvEtDmRgo_5ZrI5JrU7UGuE_Ry ', 'We look forward to seeing you at the event later this week. ', 'All my best. ', 'See the Poster ', 'Dr. Nalin Suranjith ', 'Organizers: Dr. Nalin Suranjith and Dr. Sarangi Athukorala. ', 'Department of Botany Faculty of Science University of Peradeniya ', 'Display Category ', 'All News Events Noticeboard ', 'Other News and Events ', 'Environmental Consciousness Program ', '2019/2020 June 03, 2020 ', 'International Conference on Environment and Medical Statistics 2020 (ICEMS 2020) ', 'March 11, 2020 ', 'Best', 'Undergraduate Physics Research Project Award Competition - 2019 March 11, 2020 ', 'Volunteers Needed! ', 'November 11, 2019 ', 'Inauguration of the New Building for the Department of Statistic & Computer Science June 14, 2019 ', 'A talk on Accelerating Scientific Research with Machine Learning and AI April 30, 2019 ', \"Jurors' Distinction Award in the category of Environment and Green Energy at eSwabhimani - Digital Social Impact Awards 2018 December 14, 2018 \", 'Career Guidance Workshop for Final year', 'Peradeniya Undergrads November 05, 2018 ', 'Saving the Next Generation:', 'Restoration of degraded sites at the Knuckles Forest Reserve FIELD VISIT October 18, 2018 ', 'Academic Programme, Semester II - 2017/2018 ', 'August 15, 2018 ']"}
{"title": "CSUP - Before Year 2020", "link": "https://csup.soc.pdn.ac.lk/events/before-year-2020", "sentences": "[' CSUP - Before Year 2020 ', 'Search this site Before Year 2020 ', 'CSUP Talks Field Visits ', 'CSUP Core Game Night ', 'IoT Exhibition OL Seminar Report abuse Report abuse ']"}
{"title": "CSUP - Year 2020", "link": "https://csup.soc.pdn.ac.lk/events/year-2020", "sentences": "[' CSUP - Year 2020 ', 'Search this site Year 2020 ', 'Fundamentals of C Programming Data Science and Business Intelligence Software Testing and Test Automation Report abuse Report abuse ']"}
{"title": "News & Events", "link": "https://sci.pdn.ac.lk/botany/news-events.php", "sentences": "[' News & Events ', 'Toggle navigation ', \"HOME ABOUT About Us Resources Students' Societies \", 'ACADEMIC Undergraduate Courses ', 'Postgraduate Courses ', 'e-Learning STAFF Academic ', 'Non-Academic RESEARCH SERVICES ', 'SOCIETIES SCHOLARSHIPS E-LEARNING NEWS SOCIETIES CONTACT News & Events Demise of Dr. M.H.V. Cooray, Former Senior Lecturer, Department of Botany Thu, 19 Nov, 2020 Demise of Dr. M.H.V. Cooray, Former Senior Lecturer, Department of Botany ... ', 'Other NEWS and EVENTS Virtual Speaker Series:', 'Talk', 'No 03 - Planning for Your Graduate Studies and the Life Beyond - Sep 22, 2020 ', 'Virtual Speaker Series - August 2020 - Aug 11,', '2020 ', 'Virtual Speaker Series - July 2020 - Jul 15, 2020 ', 'Environmental Consciousness Program ', '2019/2020 - ', 'Jun 3, 2020 ', 'Volunteers Needed! ', '- Nov 11, 2019 ']"}
{"title": "UPSAA - News", "link": "https://sci.pdn.ac.lk/alumni/news.php", "sentences": "[' UPSAA - News News Blog News ', 'Search Latest News Posts ']"}
{"title": "CSUP - Events", "link": "https://csup.soc.pdn.ac.lk/events", "sentences": "[' CSUP - Events Search this site Events Upcoming events Bootstrap BootCamp ', 'Hi all!! ', 'Would you like to learn the responsive web design for your customize pages? ', \"Here's the best place to awaken the better you! \", 'Content ', '--------------------------- ', '* Introduction to Bootstrap ', '* Introduction to jquery ', '* Introduction ajax ', '* Live coding website using bootstrap styles and grid system ', '* Handle events using jquery ', '* Introduction to jquery plugins ', '* deploy to the live server Join us to the next level of BootCamp series about \"Bootstrap and jQuery\" conducted by CSUP. ', 'Why wait??', 'Turn your steering to be professional with the world.. ', 'Be hurry & get your self registered now.. ', 'https://docs.google.com/forms/d/e/1FAIpQLSeHnN9I3EKndzGjZ7dtf--ugUW8U91BILhkGxcFAuVV3CEMnQ/viewform?usp=sf_link ', 'Stay tuned!!! ', '#CSUP #BootCamp #Bootstrap Report abuse Report abuse ']"}
