{"title": "CSUP - Year 2021", "link": "https://csup.soc.pdn.ac.lk/events/year-2021", "sentences": "Year 2021 Basic HTML CSS JavaScript for Web Design Python Workshop Online Sessio n VLeader 1.4 Official Network Partner"}
{"title": "Coronavirus (COVID-19) Pandemic", "link": "https://sci.pdn.ac.lk/news/emergency/", "sentences": "News Item World health organization has declared new Coronavirus disease (COVID-19) as a pandemic and Sri Lankan government takes maximum security measures to control the spreading of COVID-19 within the country. Coronavirus Disease (COVID-19) SARS-CoV-2 virus transmission leading to COVID-19 What Happens If You Get Coronavirus? How COVID-19 Affects the Body? Corona virus : Symptoms & Caregiving (English) (Sinhala) (Tamil) General Safety rules: Observe at least one metre distance between persons at all time. Wash hands regularly with liquid soap. Welcome each other without physical contact. Do not share personal equipment (tablet, phones, stationary). Stay at home/hostel if you show any symptoms of Covid-19. Contact the Health Centre if you are in a hostel. In classrooms (theory or practical), every person should, at all times, wear a mask. Masks are to be disposed in a bin with a lid. Do not litter. Category All News Events Noticeboard"}
{"title": "News and Events", "link": "https://sci.pdn.ac.lk/news-events.php?id=122", "sentences": "News & Events Recent  Virtual Speaker Series - August 2020 August 11, 2020 Dear All, Please join us for the Department of Botany, University of Peradeniya Virtual Speaker Series this Sunday, August 16, at 09:00 a.m. for the seminar titled \"Knowledge of Plant Biology: Key to Growing Better Crops \" by Dr. Tharindu Weeraratne , Director of Crop Science and Agronomy, Autogrow, New Zealand. After the talk, we will discuss the study and career opportunities in New Zealand. Space is limited, so please register to participate. Register Here https://learn.zoom.us/meeting/register/u5YvcuqsrjooGNyG1KqBfSPJgkfkAObgIKKt We look forward to seeing you at the event later this week. All my best. See the Poster Dr. Nalin Suranjith Organizers: Dr. Nalin Suranjith and Dr. Sarangi Athukorala. Department of Botany Display Category All News Events Noticeboard Other Virtual Speaker Series: Talk No 03 - Planning for Your Graduate Studies and the Life Beyond September 22, 2020 Fully Automatic Hand Washing Unit July 22, 2020 Virtual Speaker Series - July 2020 July 15, 2020 Environmental Consciousness Program 2019/2020 June 03, 2020 International Conference on Environment and Medical Statistics 2020 (ICEMS 2020) March 11, 2020 Best Undergraduate Physics Research Project Award Competition - 2019 March 11, 2020 Volunteers Needed! November 11, 2019 Inauguration of the New Building for the Department of Statistic & Computer Science June 14, 2019 A talk on Accelerating Scientific Research with Machine Learning and AI April 30, 2019 Jurors' Distinction Award in the category of Environment and Green Energy at eSwabhimani - Digital Social Impact Awards 2018 December 14, 2018"}
{"title": "CSUP - Events", "link": "https://csup.soc.pdn.ac.lk/events", "sentences": "Events Upcoming events CSUP Talks - Software Development Want to learn Software Development? 👩 ‍ 💻 As the Computer Society University of Peradeniya (CSUP) is ready to provide you the knowledge session CSUP Talks guest lecturer series for the 5th consecutive time with a talented resourced person Dimuthu Leelarathne as the speaker for the event. Register 🔜 https://forms.gle/T1APHaifHDRmBjj16 📅 Date : 21st January 2021 🕕 Time : 6pm 💻 Venue : Zoom platform Bootstrap BootCamp Hi all!! Would you like to learn the responsive web design for your customize pages? Here's the best place to awaken the better you! Content --------------------------- * Introduction to Bootstrap * Introduction to jquery * Introduction ajax * Live coding website using bootstrap styles and grid system * Handle events using jquery * Introduction to jquery plugins * deploy to the live server Join us to the next level of BootCamp series about \"Bootstrap and jQuery\" conducted by CSUP. Why wait?? Turn your steering to be professional with the world.. Be hurry & get your self registered now.. https://docs.google.com/forms/d/e/1FAIpQLSeHnN9I3EKndzGjZ7dtf--ugUW8U91BILhkGxcFAuVV3CEMnQ/viewform?usp=sf_link Stay tuned!!! #CSUP #BootCamp #Bootstrap"}
{"title": "UPSAA - News", "link": "https://sci.pdn.ac.lk/alumni/news.php", "sentences": "News Blog News Search Latest News Posts"}
{"title": "News & Events", "link": "https://sci.pdn.ac.lk/seu/news-events.php", "sentences": "Toggle navigation HOME ABOUT ACADEMIC Undergraduate Courses Postgraduate Courses e-Learning STAFF Academic Non-Academic RESEARCH SERVICES SERVICES Science Camps Training Programmes Resource Centre SOCIETIES PUBLICATIONS E-LEARNING NEWS CONTACT No recent NEWS or EVENT to show !! Other NEWS and EVENTS No Other NEWS to Show !!"}
{"title": "CSUP - Year 2020", "link": "https://csup.soc.pdn.ac.lk/events/year-2020", "sentences": "Year 2020 Fundamentals of C Programming Data Science and Business Intelligence Software Testing and Test Automation"}
{"title": "CSUP - Before Year 2020", "link": "https://csup.soc.pdn.ac.lk/events/before-year-2020", "sentences": "Before Year 2020 CSUP Talks Field Visits CSUP Core Game Night IoT Exhibition OL Seminar"}
